d = {".-": "А", "-...": "Б", ".--": "В", "--.": "Г", "-..": "Д", ".": "Е",
     "...-": "Ж", "--..": "З", "..": "И", ".---": "Й", "-.-": "К", ".-..": "Л",
     "--": "М", "-.": "Н", "---": "О", ".--.": "П", ".-.": "Р", "...": "С",
     "-": "Т", "..-": "У", "..-.": "Ф", "....": "Х", "-.-.": "Ц", "---.": "Ч",
     "----": "Ш", "--.-": "Щ", ".--.-": "Ъ", "-.--": "Ы", "-..-": "Ь",
     "...-...": "Э", "..--": "Ю", ".-.-": "Я", "-...-": " ",
     }

print('ENG: Write the text in Morse code to decipher into Russian.')
while True:
    try:
        for key in input().split():
            print(d[key], end='')
    except KeyError:
        print("Use only Morse code.")
